# GetSymLoc

## Description
Procedure GetSymLoc returns the insertion point of the referenced symbol or plug-in object.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE GetSymLoc(
				symHd : HANDLE;
				VAR p : REAL);
```

```python

def vs.GetSymLoc(symHd):
    return p
```

## Parameters
|Name|Type|Description|
|---|---|---|
|symHd|HANDLE|Handle to placed symbol.|
|p|REAL|Returns insertion point of symbol|

## Version
Availability: from MiniCAD
## Category
* Object Info